---
layout: post
title: "네트워크 1일 차"
img: Network.jpg # Add image post (optional)
date: 2017-07-03 12:55:00 +0300
description: You’ll find this post in your `_posts` directory. Go ahead and edit it and re-build the site to see your changes. # Add post description (optional)
tag: [Network, CISCO, BOB]
---
네트워킹 - 서로 연결하여 대화할 수 있는 것, 장비들을 서로 대화가 가능하도록 묶어 주는 것
인터넷 - 다른 네트워크의 정보를 공유.
 1. 하나의 프로토콜을 사용 (프로토콜: 대화의 규칙) - 다른 프로토콜을 사용하면 대화가 불가능. TCP/IP
 2. 웹 브라우저를 이용하여 인터넷 탐험
 3. 필요한 정보는 다 있다.
인트라넷 - 어떤 내부에서만 정보를 서로 웹 브라우저로 공유하려고 만든 것.
엑스트라넷 - 어떤 내부외 범위를 조금 더 넓게 설정가능. (예: 기업의 인트라넷을 그 기업 외 협력체, 고객도 사용가능
LAN(Local Area Network) - 사무실의 30대의 컴퓨터를 네트워크로 구성한다면 사무실에 LAN구축한다.
이터넷 - 네트워킹의 한 방식. CSMA/CD 프로토콜 사용.
CSMA/CD - 대충 알아서 눈치로 통신하자, 우선 네트워크 자원을 쓰고있는 PC나 서버가 있는지를 확인해보는 것(Carrier sense).있다면 기다리고 없으면 통신. 그런데 두 대의 컴퓨터가 서로 눈치를 보다가 통신이 없는 걸 알고 데이털르 보내면 이 상항이 Multiple Access가 된다. 이런 경우 충돌(Collsion) 발생. 충돌 발생하면 랜덤시간 대기.
토큰링 - 네트워크에 한 토큰씩 토큰을 가진 PC만 네트워크에 데이터 전송가능. 단점은 지금 바로 보내야하는 데이터와 다른 PC들은 보낼 데이터가 없어도 차례를 기다려야함.
UTP(twisted pair) 케이블
 카테고리 1. 전화망 용도, 데이터 전송용 x
 카테고리 2. 데이터 최대 4mbps 전송 가능
 카테고리 3. 10 base T 네트워크에 사용되는 가장 일반적인 케이블 최대 10mbps 전송가능.
 카테고리 4.  토큰링 네트워크에 사용됨. 16mbps
 카테고리 5. 

---------케이블--------
>Meida Access Control
Q. 어떻게 컴퓨터는 네트워크 상에서 서로를 구별할 수 있을까?
A. 통신을 위해서 서로를 구분할 일종의 주소를 지닌다. 이것이 MAX다.
Extra : IP주소만 있으면 통신이 일어날 것 같지만,실제로는 IP를 MAC로 바꾸는 ARP(Address Resolution Protocol)을 진행한다.


하나의 네트워크 안에서의 통신
PC Y -> PC Z
Y는 자신이 속한 네트워크에 속한 PC들에게 Z의 MAC 알고싶다라는 메세지 보냄.
Z는 Y와 같은 네트워크임으로 Y의 브로드캐스트 받음.
Z가 Y에게 자신의 MAC를 전송하고 그걸 받은 Y가 받으면 통신 시작.
if ) Z가 다른 네트워크에 있을 경우.
	라우터를 넘어 다른 네트워크에 있는 경우에는, 그 메세지를 Z는 받을 수 없다. 왜냐하면 중간에 라우터가 막기때문.
	Y가 메세지를 보내도 아무도 답을 하지않는 것을 라우터가 알게되면, 라우터 자신의 MAC를 보내줍니다. 그렇다면 Y가 그걸 받으면 통신시작
	Y가 라우터에게 정보를 보내면 라우터가 그 정보를 다시 Z에게 or 그쪽 라우터에게 전송.
네트워크에 붙는 장비들은 48bit 주소를 가짐.각 주소는 랜카드 or 네트워크 장비에 고정된 고유 주소. 이 주소를 MAC
모든 랜 상의 devices들은 유일한 MAC가져야함.
MAC 주소는 이진수 48bit로 이루어짐.
ex) 0060.978F.4F86
	앞의 6개의 숫자를 베더라고함. 생산자를 나타내고 OUI(Organizational Unique Identifier) - 이것을 보면 어느 메이커인지 알 수 있다.
	나머지 6개의 숫자는 각 장비에 부여하는 시리얼 넘버 Host Identifier
	












>Casting : 네트워크에서 통신을 하는 방식.

유니캐스트 - 가장 일반적으로 네트워크 상에서 사용하는 트래픽
		  PC 006080AABBCC->PC 006080DDEEFF
		  통신을 위해서 전송되는 프레임 안에 출발지, 도착지의 MAC 저장하는 방식.
		  받는 PC의 주소는 프레임 안에 쓸때 그 PC는 하나여야한다.
		  편지 받을 사람 주소 적고 우체통에 넣는 방식.
		  그러면 PC가 유니캐스트 프레임을 뿌리면 로컬 이더넷의 모든 PC들 이 프레임을 받아 비교한다.

	